In [2]:
#sum of n numbers
fact=function(num){
    if(num==1){
        return(1)
    }else{
        return(num*fact(num-1))
    }
}
n=as.integer(readline("Enter a number:L"))
fact(n)

Enter a number:L3

[1] 6

In [4]:
#get the term one subject and print the result in sorted order 
n=c('python','data science','java')
sort(n)

[1] "data science" "java"         "python"

In [6]:
#default argument
elective=function(name,uniqueId,dept="ds"){
   print(paste("name:",name,"uniqueId:",uniqueId,"dept:",dept)) 
}
name=readline("enter the name:")
uniqueId=readline("enter the id:")
dept=readline("enter the dep:")
if(dept==""){
    elective(name,uniqueId)
}else{
    elective(name,uniqueId,dept)
}

enter the name:siva
enter the id:27
enter the dep:cs
[1] "name: siva uniqueId: 27 dept: cs"

In [1]:
#regular expression
n=as.integer(readline("enter the credit card num:"))
if(n=='%4')
    {
    print('valid')
}else if(n == '%5')
    {
    print('valid')
}else if(n == '%7')
    {
    print('valid')
}else{
    print('invalid')
}

enter the credit card num:2345678
[1] "invalid"

In [2]:
pattern ="[4,7,9]{1}\\d{3}\\s\\d{4}\\s[1-9]{4}"
rndmTEXT="this is my cc 4123 5678  9098 8789"
str_extract_all(rndmTEXT,pattern)

ERROR: Error in str_extract_all(rndmTEXT, pattern): could not find function "str_extract_all"

In [3]:
words<-"i hav six banana"
sub("six",6,words)

[1] "i hav 6 banana"

In [4]:
df=read.csv("employee.csv")

In [5]:
ncol(df)

[1] 10

In [6]:
nrow(df)

[1] 50

In [7]:
head(df,10)

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1  198         Donald     OConnell  DOCONNEL 650.507.9833 21-Jun-07 SH_CLERK
2  199         Douglas    Grant     DGRANT   650.507.9844 13-Jan-08 SH_CLERK
3  200         Jennifer   Whalen    JWHALEN  515.123.4444 17-Sep-03 AD_ASST
4  201         Michael    Hartstein MHARTSTE 515.123.5555 17-Feb-04 MK_MAN
5  202         Pat        Fay       PFAY     603.123.6666 17-Aug-05 MK_REP
6  203         Susan      Mavris    SMAVRIS  515.123.7777 07-Jun-02 HR_REP
7  204         Hermann    Baer      HBAER    515.123.8888 07-Jun-02 PR_REP
8  205         Shelley    Higgins   SHIGGINS 515.123.8080 07-Jun-02 AC_MGR
9  206         William    Gietz     WGIETZ   515.123.8181 07-Jun-02 AC_ACCOUNT
10 100         Steven     King      SKING    515.123.4567 17-Jun-03 AD_PRES
   SALARY MANAGER_ID DEPARTMENT_ID
1   2600  124         50
2   2600  124         50
3   4400  101         10
4  13000  100         20
5   6000  201         20
6   6500  101         40
7  10000  101         70
8  12008  101        110
9   8300  205        110
10 24000   -          90

In [8]:
tail(df)

   EMPLOYEE_ID FIRST_NAME LAST_NAME  EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
45 135         Ki         Gee        KGEE     650.127.1734 12-Dec-07 ST_CLERK
46 136         Hazel      Philtanker HPHILTAN 650.127.1634 06-Feb-08 ST_CLERK
47 137         Renske     Ladwig     RLADWIG  650.121.1234 14-Jul-03 ST_CLERK
48 138         Stephen    Stiles     SSTILES  650.121.2034 26-Oct-05 ST_CLERK
49 139         John       Seo        JSEO     650.121.2019 12-Feb-06 ST_CLERK
50 140         Joshua     Patel      JPATEL   650.121.1834 06-Apr-06 ST_CLERK
   SALARY MANAGER_ID DEPARTMENT_ID
45 2400   122        50
46 2200   122        50
47 3600   123        50
48 3200   123        50
49 2700   123        50
50 2500   123        50

In [9]:
max(df$SALARY)

[1] 24000

In [10]:
min(df$SALARY)

[1] 2100

In [12]:
a=subset(df,SALARY==max(SALARY))
a

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL PHONE_NUMBER HIRE_DATE JOB_ID  SALARY
10 100         Steven     King      SKING 515.123.4567 17-Jun-03 AD_PRES 24000
   MANAGER_ID DEPARTMENT_ID
10  -         90

In [13]:
table(df$JOB_ID)

AC_ACCOUNT     AC_MGR    AD_ASST    AD_PRES      AD_VP FI_ACCOUNT     FI_MGR
         1          1          1          1          2          5          1
    HR_REP    IT_PROG     MK_MAN     MK_REP     PR_REP   PU_CLERK     PU_MAN
         1          5          1          1          1          5          1
  SH_CLERK   ST_CLERK     ST_MAN
         2         16          5

In [16]:
a=subset(df,JOB_ID=="SH_CLERk")
a

     EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL PHONE_NUMBER HIRE_DATE JOB_ID
     SALARY MANAGER_ID DEPARTMENT_ID

In [17]:
a=subset(df,SALARY>5000 &JOB_ID =='IT_PROG')
a

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL   PHONE_NUMBER HIRE_DATE JOB_ID
13 103         Alexander  Hunold    AHUNOLD 590.423.4567 03-Jan-06 IT_PROG
14 104         Bruce      Ernst     BERNST  590.423.4568 21-May-07 IT_PROG
   SALARY MANAGER_ID DEPARTMENT_ID
13 9000   102        60
14 6000   103        60

In [18]:
install.packages("lubridate")

also installing the dependencies 'cpp11', 'timechange', 'generics'

  There are binary versions available but the source versions are later:
           binary source needs_compilation
cpp11       0.2.7  0.4.3             FALSE
timechange  0.0.2  0.1.1              TRUE
generics    0.1.0  0.1.3             FALSE
lubridate  1.7.10  1.9.0              TRUE

  Binaries will be installed
package 'timechange' successfully unpacked and MD5 sums checked
package 'lubridate' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\SHYNI\AppData\Local\Temp\Rtmpms1Nnn\downloaded_packages

installing the source packages 'cpp11', 'generics'

In [20]:
library("lubridate")

In [23]:
library("xlsx")
df=read.csv("https://raw.githubusercontent.com/rsquaredacademy/datasets/master/transact.csv&quot;)

ERROR: Error in parse(text = x, srcfile = src): <text>:2:13: unexpected INCOMPLETE_STRING
1: library("xlsx")
2: df=read.csv("https://raw.githubusercontent.com/rsquaredacademy/datasets/master/transact.csv&quot;)
               ^

In [24]:
ymd(df$Invoice)

Date of length 0

In [28]:
wday(df$Invoice)

ERROR: Error in as.POSIXlt.default(x, tz = tz(x)): do not know how to convert 'x' to class "POSIXlt"

In [29]:
month(df$Invoice)

ERROR: Error in as.POSIXlt.default(x, tz = tz(x)): do not know how to convert 'x' to class "POSIXlt"

In [30]:
day(df$Invoice)

ERROR: Error in as.POSIXlt.default(x, tz = tz(x)): do not know how to convert 'x' to class "POSIXlt"

In [31]:
df$Invoice

NULL

In [32]:
a=as.Date(df$Due)-as.Date(df$Invoice)
a

ERROR: Error in as.Date.default(df$Due): do not know how to convert 'df$Due' to class "Date"